/* DreamShell ##version##

   fs_iso9660.c - Virtual ISO9660 filesystem
   Copyright (C)2000,2001,2003 Dan Potter
   Copyright (C)2001 Andrew Kieschnick
   Copyright (C)2002 Bero
   Copyright (C)2011-2023 SWAT
*/

#include <ds.h>
#include <isofs/isofs.h>
#include <isofs/ciso.h>
#include <isofs/cdi.h>
#include <isofs/gdi.h>
#include "internal.h"

/* List of cache blocks (ordered least recently used to most recently) */
#define NUM_CACHE_BLOCKS 4

#ifndef MAX_ISO_FILES
# define MAX_ISO_FILES 16
#endif

/* Holds the data for one cache block, and a pointer to the next one.
   As sectors are read from the disc, they are added to the front of
   this cache. As the cache fills up, sectors are removed from the end
   of it. */
typedef struct {
	int32	sector;			/* CD sector */
	uint8	data[2048];		/* Sector data */
} cache_block_t;


/* ISO Directory entry */
typedef struct {
	uint8	length;			/* 711 */
	uint8	ext_attr_length;	/* 711 */
	uint8	extent[8];		/* 733 */
	uint8	size[8];		/* 733 */
	uint8	date[7];		/* 7x711 */
	uint8	flags;
	uint8	file_unit_size;		/* 711 */
	uint8	interleave;		/* 711 */
	uint8	vol_sequence[4];	/* 723 */
	uint8	name_len;		/* 711 */
	char	name[1];
} virt_iso_dirent_t;


typedef struct isofs {
        
    SLIST_ENTRY(isofs) list;
    vfs_handler_t *vfs;
    const char *fn;
    file_t fd;

	CDROM_TOC toc;
	uint32 session_base;
	uint32 root_extent;							/* Root directory extent */
	uint32 root_size;								/* Root directory size in bytes */
	virt_iso_dirent_t root_dirent;				/* Root dirent */
	int joliet;

	cache_block_t *icache[NUM_CACHE_BLOCKS];	/* inode cache */
	cache_block_t *dcache[NUM_CACHE_BLOCKS];	/* data cache */
	mutex_t cache_mutex;							/* Cache modification mutex */

	uint32 type;
	CISO_header_t *ciso;
	CDI_header_t  *cdi;
	GDI_header_t  *gdi;

} isofs_t;


/* File handles.. I could probably do this with a linked list, but I'm just
   too lazy right now. =) */
static struct {
	uint32		first_extent;	/* First sector */
	int			dir;		/* >0 if a directory */
	uint32		ptr;		/* Current read position in bytes */
